d_input=int(input("введите целое число от 1 до  12"))
dict_a={9:"сентябрь",10:"октябрь",11:"ноябрь",12:"декабрь",1:"январь",2:"февраль",3:"март",4:"апрель",5:"май",6:"июнь",7:"июль",8:"август"}
dict_b={9:"осень",10:"осень",11:"осень",12:"зима",1:"зима",2:"зима",3:"весна",4:"весна",5:"весна",6:"лето",7:"лето",8:"лето"}
print("поиск через dict: определён месяц:",dict_a[d_input],",  время года:",dict_b[d_input])



list_a=[15,17,19,21,23,25,27,29,31,33,35,37,"зима","декабрь","зима","январь","зима","февраль","весна","март","весна","апрель","весна","май","лето","июнь","лето","июль","лето","август","осень","сентябрь","осень","октябрь","осень","ноябрь","зима","декабрь"]
d_input=d_input-1
month_index=list_a[d_input]
month=list_a[month_index]

srason_index=month_index-1
season=list_a[srason_index]
print("поиск через list: определён месяц:",month,",  время года:",season)

